app/controllers/messages_controller.rb

INSERT INTO "messages" ("msg", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["msg", "Hello!"], ["created_at", "2023-03-06 21:57:06.071261"], ["updated_at", "2023-03-06 21:57:06.071261"]]
---
  def create
    @message = Message.new(message_params)

    respond_to do |format|
      if @message.save